app/Controllers/Contract.php

SELECT *
FROM `contracts`
WHERE `contracts`.`id` = '12'
---
    public function edit($id)
    {
        $conModel = new ConModel();
        $data['contract'] = $conModel->find($id);