app/Controllers/Login.php

    public function authenticate()
    {
        $userModel = new UserModel;

        $email = $this->request->getPost("email");
        $password = $this->request->getPost("password");

       # $password = password_hash("password", PASSWORD_BCRYPT);
        $result = $userModel->where("email", $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sc@gmail.com'
 LIMIT 1